<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Kaggle-Data" data-toc-modified-id="Kaggle-Data-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Kaggle Data</a></span></li><li><span><a href="#Imports" data-toc-modified-id="Imports-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Imports</a></span></li><li><span><a href="#Viewing-Data" data-toc-modified-id="Viewing-Data-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Viewing Data</a></span><ul class="toc-item"><li><span><a href="#Matches" data-toc-modified-id="Matches-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Matches</a></span><ul class="toc-item"><li><span><a href="#Using-Where-clause" data-toc-modified-id="Using-Where-clause-3.1.1"><span class="toc-item-num">3.1.1&nbsp;&nbsp;</span>Using Where clause</a></span></li></ul></li><li><span><a href="#Teams-in-Matches" data-toc-modified-id="Teams-in-Matches-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Teams in Matches</a></span></li><li><span><a href="#Teams" data-toc-modified-id="Teams-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Teams</a></span></li><li><span><a href="#Team-IDs" data-toc-modified-id="Team-IDs-3.4"><span class="toc-item-num">3.4&nbsp;&nbsp;</span>Team IDs</a></span></li><li><span><a href="#JOINS" data-toc-modified-id="JOINS-3.5"><span class="toc-item-num">3.5&nbsp;&nbsp;</span>JOINS</a></span></li><li><span><a href="#UNION" data-toc-modified-id="UNION-3.6"><span class="toc-item-num">3.6&nbsp;&nbsp;</span>UNION</a></span></li></ul></li></ul></div>

# Kaggle Data


https://www.kaggle.com/laudanum/footballdelphi

| Table | Total Rows| Total Columns|
| ----- | --------- | -------------|
|Matches|24625      |9             |
|Teams  |468        |8|
|Teams_in_Matches|49148         |2|
|Unique_Teams    | 128      |   2|

# Imports

In [1]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('database.sqlite')
cur = conn.cursor()

# Viewing Data

## Matches

In [2]:
# A rudimentary way to get information

cur.execute("""SELECT * 
               FROM Matches 
               LIMIT 5;""")

In [3]:
cur.fetchall()

[(1, 'D2', 2009, '2010-04-04', 'Oberhausen', 'Kaiserslautern', 2, 1, 'H'),
 (2, 'D2', 2009, '2009-11-01', 'Munich 1860', 'Kaiserslautern', 0, 1, 'A'),
 (3, 'D2', 2009, '2009-10-04', 'Frankfurt FSV', 'Kaiserslautern', 1, 1, 'D'),
 (4, 'D2', 2009, '2010-02-21', 'Frankfurt FSV', 'Karlsruhe', 2, 1, 'H'),
 (5, 'D2', 2009, '2009-12-06', 'Ahlen', 'Karlsruhe', 1, 3, 'A')]

In [4]:
# wrapping results in a pandas dataframe

cur.execute("""SELECT * FROM matches;""") 
match = pd.DataFrame(cur.fetchall())
match.columns = [x[0] for x in cur.description]
match.head()

,Match_ID,Div,Season,Date,HomeTeam,AwayTeam,FTHG,FTAG,FTR
0,1,D2,2009,2010-04-04,Oberhausen,Kaiserslautern,2,1,H
1,2,D2,2009,2009-11-01,Munich 1860,Kaiserslautern,0,1,A
2,3,D2,2009,2009-10-04,Frankfurt FSV,Kaiserslautern,1,1,D
3,4,D2,2009,2010-02-21,Frankfurt FSV,Karlsruhe,2,1,H
4,5,D2,2009,2009-12-06,Ahlen,Karlsruhe,1,3,A

In [5]:
match.tail()

,Match_ID,Div,Season,Date,HomeTeam,AwayTeam,FTHG,FTAG,FTR
24620,46770,E0,2016,2017-05-21,Liverpool,Middlesbrough,3,0,H
24621,46771,E0,2016,2017-05-21,Man United,Crystal Palace,2,0,H
24622,46772,E0,2016,2017-05-21,Southampton,Stoke,0,1,A
24623,46773,E0,2016,2017-05-21,Swansea,West Brom,2,1,H
24624,46774,E0,2016,2017-05-21,Watford,Man City,0,5,A

In [6]:
match.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24625 entries, 0 to 24624
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Match_ID  24625 non-null  int64
 1   Div       24625 non-null  object
 2   Season    24625 non-null  int64
 3   Date      24625 non-null  object
 4   HomeTeam  24625 non-null  object
 5   AwayTeam  24625 non-null  object
 6   FTHG      24625 non-null  int64
 7   FTAG      24625 non-null  int64
 8   FTR       24625 non-null  object
dtypes: int64(4), object(5)
memory usage: 1.7+ MB

In [7]:
# 126 unique teams
match['HomeTeam'].unique()

array(['Oberhausen', 'Munich 1860', 'Frankfurt FSV', 'Ahlen',
       'Union Berlin', 'Paderborn', 'Bielefeld', 'Kaiserslautern',
       'Hansa Rostock', 'Greuther Furth', 'Koblenz', 'Cottbus',
       'Duisburg', 'Fortuna Dusseldorf', 'Aachen', 'Augsburg', 'St Pauli',
       'Bochum', 'Bayern Munich', "M'gladbach", 'Mainz', 'Hamburg',
       'Stuttgart', 'Dortmund', 'Schalke 04', 'Freiburg', 'Werder Bremen',
       'Hertha', 'Hannover', 'Ein Frankfurt', 'Wolfsburg', 'Hoffenheim',
       'FC Koln', 'Nurnberg', 'Leverkusen', 'Karlsruhe', 'Osnabruck',
       'Erzgebirge Aue', 'Ingolstadt', 'Braunschweig', 'Dresden', 'Aalen',
       'Regensburg', 'Sandhausen', 'Heidenheim', 'RB Leipzig',
       'Darmstadt', 'Wurzburger Kickers', 'Kiel', 'Burghausen',
       'Unterhaching', 'Saarbrucken', 'Siegen', 'Offenbach', 'CZ Jena',
       'RW Essen', 'Wehen', "M'Gladbach", 'Wattenscheid', 'Chemnitz',
       'Homburg', 'Mannheim', 'Meppen', 'Stuttgarter K', 'TB Berlin',
       'F Koln', 'Uerdingen', 'Wuppertaler', 'Zwickau', 'Lubeck',
       'Gutersloh', 'Oldenburg', 'Ulm', 'Reutlingen', 'Schweinfurt',
       'Babelsberg', 'Ein Trier', 'Erfurt', 'Arsenal', 'Aston Villa',
       'Chelsea', 'Liverpool', 'Man City', 'Newcastle', 'Oldham',
       'Sheffield United', 'Southampton', 'West Ham', 'Norwich',
       'Tottenham', 'Everton', 'Ipswich', 'Leeds', 'Wimbledon',
       'Blackburn', 'Coventry', 'Man United', 'QPR', 'Sheffield Weds',
       'Swindon', 'Crystal Palace', 'Leicester', "Nott'm Forest",
       'Bolton', 'Middlesbrough', 'Derby', 'Sunderland', 'Barnsley',
       'Charlton', 'Watford', 'Bradford', 'Fulham', 'Birmingham',
       'Middlesboro', 'West Brom', 'Portsmouth', 'Wolves', 'Wigan',
       'Reading', 'Hull', 'Stoke', 'Burnley', 'Blackpool', 'Swansea',
       'Cardiff', 'Bournemouth'], dtype=object)

In [8]:
# 128 unique teams
match['AwayTeam'].nunique()

128

In [9]:
match['Div'].unique()

array(['D2', 'D1', 'E0'], dtype=object)

### Using Where clause

In [10]:
cur.execute("""SELECT * 
            FROM matches
            WHERE Season = '2009' or Season = '2016';""") 
match09 = pd.DataFrame(cur.fetchall())
match09.columns = [x[0] for x in cur.description]
match09.head()

,Match_ID,Div,Season,Date,HomeTeam,AwayTeam,FTHG,FTAG,FTR
0,1,D2,2009,2010-04-04,Oberhausen,Kaiserslautern,2,1,H
1,2,D2,2009,2009-11-01,Munich 1860,Kaiserslautern,0,1,A
2,3,D2,2009,2009-10-04,Frankfurt FSV,Kaiserslautern,1,1,D
3,4,D2,2009,2010-02-21,Frankfurt FSV,Karlsruhe,2,1,H
4,5,D2,2009,2009-12-06,Ahlen,Karlsruhe,1,3,A

In [11]:
match09.tail()

,Match_ID,Div,Season,Date,HomeTeam,AwayTeam,FTHG,FTAG,FTR
1979,46770,E0,2016,2017-05-21,Liverpool,Middlesbrough,3,0,H
1980,46771,E0,2016,2017-05-21,Man United,Crystal Palace,2,0,H
1981,46772,E0,2016,2017-05-21,Southampton,Stoke,0,1,A
1982,46773,E0,2016,2017-05-21,Swansea,West Brom,2,1,H
1983,46774,E0,2016,2017-05-21,Watford,Man City,0,5,A

## Teams in Matches

In [12]:
cur.execute("""SELECT * FROM teams_in_matches;""")
tim = pd.DataFrame(cur.fetchall())
tim.columns = [x[0] for x in cur.description]
tim.head(3)

   Match_ID  Unique_Team_ID
0         1              26
1         1              46
2         2              26

In [13]:
# cur.execute("""SELECT * 
#                FROM teams_in_matches
#                JOIN matches
#                ON Match_ID;""")
# match_ex = pd.DataFrame(cur.fetchall())
# match_ex.columns = [x[0] for x in cur.description]
# match_ex.head(3)

# Error ambiguous column name: Match_ID

In [14]:
# cur.execute("""SELECT teams_in_matches.Match_ID, matches.Match_ID
#                FROM teams_in_matches, matches;""")
# match_ex = pd.DataFrame(cur.fetchall())
# match_ex.columns = [x[0] for x in cur.description]
# match_ex.head

## Teams

In [15]:
cur.execute("""SELECT * FROM teams;""") 
teams = pd.DataFrame(cur.fetchall())
teams.columns = [x[0] for x in cur.description]
#print(df.info())
teams.head(5)

,Season,TeamName,KaderHome,AvgAgeHome,ForeignPlayersHome,OverallMarketValueHome,AvgMarketValueHome,StadiumCapacity
0,2017,Bayern Munich,27,26,15,597950000,22150000,75000
1,2017,Dortmund,33,25,18,416730000,12630000,81359
2,2017,Leverkusen,31,24,15,222600000,7180000,30210
3,2017,RB Leipzig,30,23,15,180130000,6000000,42959
4,2017,Schalke 04,29,24,17,179550000,6190000,62271

In [28]:
teams.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 468 entries, 0 to 467
Data columns (total 8 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Season                  468 non-null    object
 1   TeamName                468 non-null    object
 2   KaderHome               468 non-null    object
 3   AvgAgeHome              468 non-null    object
 4   ForeignPlayersHome      468 non-null    object
 5   OverallMarketValueHome  468 non-null    object
 6   AvgMarketValueHome      468 non-null    object
 7   StadiumCapacity         468 non-null    object
dtypes: object(8)
memory usage: 29.4+ KB

## Team IDs

In [16]:
cur.execute("""SELECT * FROM Unique_Teams;""") 
ids = pd.DataFrame(cur.fetchall())
ids.columns = [x[0] for x in cur.description]
ids.head(5)

        TeamName  Unique_Team_ID
0  Bayern Munich               1
1       Dortmund               2
2     Leverkusen               3
3     RB Leipzig               4
4     Schalke 04               5

In [17]:
ids.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 128 entries, 0 to 127
Data columns (total 2 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   TeamName        128 non-null    object
 1   Unique_Team_ID  128 non-null    int64
dtypes: int64(1), object(1)
memory usage: 2.1+ KB

In [18]:
ids.Unique_Team_ID.nunique()

128

In [19]:
cur.execute('''SELECT TeamName FROM teams WHERE season = '2011';''')
df_teams = pd.DataFrame(cur.fetchall())
# cur.execute('''SELECT count(TeamName) FROM teams WHERE season = '2011';''').fetchall() # There are 36 teams
df_teams.columns = ['team']

the_teams = df_teams['team'].unique() #returns an array, better to iterate over
the_teams

array(['Bayern Munich', 'Dortmund', 'Leverkusen', 'Schalke 04',
       'Werder Bremen', 'Wolfsburg', 'Hamburg', 'Stuttgart', 'Hoffenheim',
       'FC Koln', 'Hannover', "M'gladbach", 'Freiburg', 'Mainz', 'Hertha',
       'Kaiserslautern', 'Nurnberg', 'Augsburg', 'Ein Frankfurt',
       'St Pauli', 'Cottbus', 'Bochum', 'Fortuna Dusseldorf',
       'Greuther Furth', 'Munich 1860', 'Aachen', 'Ingolstadt',
       'Duisburg', 'Karlsruhe', 'Dresden', 'Frankfurt FSV',
       'Erzgebirge Aue', 'Hansa Rostock', 'Union Berlin', 'Paderborn',
       'Braunschweig'], dtype=object)

## JOINS

In [22]:
cur.execute('''SELECT *
               FROM teams_in_matches
               JOIN Unique_Teams
               ON teams_in_matches.unique_Team_ID = Unique_Teams.unique_Team_ID;''')
test = pd.DataFrame(cur.fetchall())
test.columns = [x[0] for x in cur.description]
test.head(5)

   Match_ID  Unique_Team_ID        TeamName  Unique_Team_ID
0         1              26  Kaiserslautern              26
1         1              46      Oberhausen              46
2         2              26  Kaiserslautern              26
3         2              42     Munich 1860              42
4         3              26  Kaiserslautern              26

In [23]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49148 entries, 0 to 49147
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Match_ID        49148 non-null  int64
 1   Unique_Team_ID  49148 non-null  int64
 2   TeamName        49148 non-null  object
 3   Unique_Team_ID  49148 non-null  int64
dtypes: int64(3), object(1)
memory usage: 1.5+ MB

In [24]:
cur.execute('''SELECT *
               FROM teams_in_matches
               JOIN Unique_Teams
               USING (Unique_Team_ID);''')
test1 = pd.DataFrame(cur.fetchall())
test1.columns = [x[0] for x in cur.description]
test1.head(5)

   Match_ID  Unique_Team_ID        TeamName
0         1              26  Kaiserslautern
1         1              46      Oberhausen
2         2              26  Kaiserslautern
3         2              42     Munich 1860
4         3              26  Kaiserslautern

In [25]:
test1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49148 entries, 0 to 49147
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Match_ID        49148 non-null  int64
 1   Unique_Team_ID  49148 non-null  int64
 2   TeamName        49148 non-null  object
dtypes: int64(2), object(1)
memory usage: 1.1+ MB

In [43]:
cur.execute('''SELECT *
               FROM teams
               JOIN Unique_Teams
               USING (TeamName);''')
test2 = pd.DataFrame(cur.fetchall())
test2.columns = [x[0] for x in cur.description]
test2.head(5)

,Season,TeamName,KaderHome,AvgAgeHome,ForeignPlayersHome,OverallMarketValueHome,AvgMarketValueHome,StadiumCapacity,Unique_Team_ID
0,2017,Bayern Munich,27,26,15,597950000,22150000,75000,1
1,2017,Dortmund,33,25,18,416730000,12630000,81359,2
2,2017,Leverkusen,31,24,15,222600000,7180000,30210,3
3,2017,RB Leipzig,30,23,15,180130000,6000000,42959,4
4,2017,Schalke 04,29,24,17,179550000,6190000,62271,5

In [30]:
test2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 468 entries, 0 to 467
Data columns (total 9 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Season                  468 non-null    object
 1   TeamName                468 non-null    object
 2   KaderHome               468 non-null    object
 3   AvgAgeHome              468 non-null    object
 4   ForeignPlayersHome      468 non-null    object
 5   OverallMarketValueHome  468 non-null    object
 6   AvgMarketValueHome      468 non-null    object
 7   StadiumCapacity         468 non-null    object
 8   Unique_Team_ID          468 non-null    int64
dtypes: int64(1), object(8)
memory usage: 33.0+ KB

In [31]:
test2

,Season,TeamName,KaderHome,AvgAgeHome,ForeignPlayersHome,OverallMarketValueHome,AvgMarketValueHome,StadiumCapacity,Unique_Team_ID
0,2017,Bayern Munich,27,26,15,597950000,22150000,75000,1
1,2017,Dortmund,33,25,18,416730000,12630000,81359,2
2,2017,Leverkusen,31,24,15,222600000,7180000,30210,3
3,2017,RB Leipzig,30,23,15,180130000,6000000,42959,4
4,2017,Schalke 04,29,24,17,179550000,6190000,62271,5
...,...,...,...,...,...,...,...,...,...
463,2005,Paderborn,33,24,13,7530000,228000,47728,21
464,2005,Unterhaching,28,26,9,7030000,251000,47728,55
465,2005,Offenbach,28,26,13,6280000,224000,47728,52
466,2005,Siegen,29,26,13,6180000,213000,47728,57
467,2005,Braunschweig,25,25,3,4150000,166000,47728,23

In [33]:
cur.execute('''SELECT *
               FROM Unique_Teams
               LEFT JOIN teams
               USING (TeamName);''')
test3 = pd.DataFrame(cur.fetchall())
test3.columns = [x[0] for x in cur.description]
test3.head(5)

,TeamName,Unique_Team_ID,Season,KaderHome,AvgAgeHome,ForeignPlayersHome,OverallMarketValueHome,AvgMarketValueHome,StadiumCapacity
0,Bayern Munich,1,2005,25,27,14,171500000,6860000,75000
1,Bayern Munich,1,2006,29,26,15,166980000,5760000,75000
2,Bayern Munich,1,2007,28,25,12,222930000,7960000,75000
3,Bayern Munich,1,2008,23,26,12,238900000,10390000,75000
4,Bayern Munich,1,2009,29,25,15,283250000,9770000,75000

In [34]:
test3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 539 entries, 0 to 538
Data columns (total 9 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   TeamName                539 non-null    object
 1   Unique_Team_ID          539 non-null    int64
 2   Season                  468 non-null    object
 3   KaderHome               468 non-null    object
 4   AvgAgeHome              468 non-null    object
 5   ForeignPlayersHome      468 non-null    object
 6   OverallMarketValueHome  468 non-null    object
 7   AvgMarketValueHome      468 non-null    object
 8   StadiumCapacity         468 non-null    object
dtypes: int64(1), object(8)
memory usage: 38.0+ KB

In [39]:
test3.Unique_Team_ID.unique()

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
        27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,
        53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,
        66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,
        79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,
        92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103, 104,
       105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117,
       118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128])

In [41]:
test3.Season.unique()

array(['2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012',
       '2013', '2014', '2015', '2016', '2017', None], dtype=object)

## UNION

In [47]:
# cur.execute("""SELECT HomeTeam
#             FROM matches
#             WHERE Season = '2009'
#             UNION 
#             SELECT TeamName
#             FROM teams
#             WHERE Season = '2009';""") 
# test4 = pd.DataFrame(cur.fetchall())
# test4.columns = [x[0] for x in cur.description]
# test4

cur.execute("""SELECT HomeTeam
            FROM matches
            WHERE Season = '2009';""") 
test4 = pd.DataFrame(cur.fetchall())
test4.columns = [x[0] for x in cur.description]
test4

          HomeTeam
0       Oberhausen
1      Munich 1860
2    Frankfurt FSV
3    Frankfurt FSV
4            Ahlen
..             ...
987        Everton
988           Hull
989     Man United
990       West Ham
991         Wolves

[992 rows x 1 columns]